


const SpatialEngineering = () =>{
    const SpatialEngineeringlessons = [
        {
            'name' : ':المحاضرة الأولي',
            'parts' :['الجزء الاول:التمهيد','الجزء الثاني: معادلة الكرة في الفراغ'],
            'exam' : 'امتحان المحاضرة الاولي'
        },
        {
            'name' : 'المحاضرة الثانية:',
            'parts' :['الجزء الاول:المتجهات في الفراغ'],
            'exam' : 'امتحان المحاضرة الثانية'
        },
        {
            'name' : 'المحاضرة الثالثة:',
            'parts' :['الجزء الاول:الضرب القياسي'],
            'exam' : 'امتحان المحاضرة الثالثة'
        },
        {
            'name' : 'المحاضرة الرابعة:',
            'parts' :['الجزء الاول: الضرب الاتجاهي'],
            'exam' : 'امتحان الهندسة الفراغية 1'
        },
        {
            'name' : 'المحاضرة الخامسة:',
            'parts' :['الجزء الاول: معادلة الخط المستقيم'],
            'exam' : 'امتحان المحاضرة الخامسة'
        },
        {
            'name' : 'المحاضرة السادسة:',
            'parts' :['الجزء الاول: معادلة المستوي'],
            'exam' : 'امتحان الهندسة الفراغية 2 '
        }
    ]

    const Algebralessons = [
        {
            'name' : 'المحاضرة الاولي - ذات الحدين',
            'parts' :['تمهيد','الجزء الاول','الجزء الثاني','الجزء الثالث','أوبن بوك'],
            'exam' : 'امتحان المحاضرة الاولي'
        },
        {
            'name' : 'المحاضرة الثانية - ذات الحدين',
            'parts' :['الجزء الاول','الجزء الثاني','أوبن بوك'],
            'exam' : 'امتحان المحاضرة الثانية'
        },
        {
            'name' : 'المحاضرة الثالثة - ذات الحدين',
            'parts' :['الجزء الاول','الجزء الثاني','أوبن بوك'],
            'exam' : 'امتحان ذات الحدين'
        },
        {
            'name' : 'المحاضرة الاولي - الاعداد المركبة',
            'parts' :['الجزء الاول','الجزء الثاني','أوبن بوك'],
            'exam' : 'امتحان المحاضرة الاولي'
        },
        {
            'name' : 'المحاضرة الثانية - الاعداد المركبة',
            'parts' :['الجزء الاول','الجزء الثاني','أوبن بوك'],
            'exam' : 'امتحان المحاضرة الثانية'
        },
        {
            'name' : 'المحاضرة الثالثة - الاعداد المركبة',
            'parts' :['الجزء الاول','الجزء الثاني','أوبن بوك'],
            'exam' : 'امتحان الاعداد المركبة'
        }
        
        ,
        {
            'name' : 'المحاضرة الاولي - التباديل والتوافيق',
            'parts' :['أوبن بوك'],
            'exam' : 'امتحان المحاضرة الاولي'
        },
        {
            'name' : 'المحاضرة الثانية - التباديل والتوافيق',
            'parts' :['أوبن بوك'],
            'exam' : 'امتحان المحاضرة الثانية'
        },
        {
            'name' : 'المحاضرة الثالثة - التباديل والتوافيق',
            'parts' :['الجزء الاول','الجزء الثاني','أوبن بوك'],
            'exam' : 'امتحان التباديل والتوافيق'
        },
        {
            'name' : 'المحاضرة الاولي - المحدادت',
            'parts' :['أوبن بوك'],
            'exam' : 'امتحان المحاضرة الاولي'
        },
        {
            'name' : 'المحاضرة الثانية - المحدادت',
            'parts' :['أوبن بوك'],
            'exam' : 'امتحان المحاضرة الثانية'
        },
        {
            'name' : 'المحاضرة الثالثة - المحدادت',
            'parts' :['أوبن بوك'],
            'exam' : 'امتحان المحدادت'
        }

        ,
        {
            'name' : 'المحاضرة الاولي - المصفوفات',
            'parts' :['أوبن بوك'],
            'exam' : 'امتحان المحاضرة الاولي'
        },
        {
            'name' : 'المحاضرة الثانية - المصفوفات',
            'parts' :['أوبن بوك'],
            'exam' : 'امتحان المصفوفات'
        },

    ]
    return 0;
}

export default SpatialEngineering;